### Terraform Plan Results 📊

#### Format Check 🖌️ `failure`
#### Validation ✅ `success`
#### Plan 📋 `success`

<details><summary>Show Plan Output</summary>

```terraform
data.aws_ami.ubuntu: Reading...
aws_cloudwatch_log_group.scim_server: Refreshing state... [id=/aws/ec2/scim-demo]
aws_iam_role.scim_server: Refreshing state... [id=scim-demo-ec2-20251022011047295400000001]
aws_eip.scim_server: Refreshing state... [id=eipalloc-0bdd83b94f355fd29]
aws_security_group.scim_server: Refreshing state... [id=sg-061f37dcea9f88e98]
aws_iam_role_policy_attachment.ssm: Refreshing state... [id=scim-demo-ec2-20251022011047295400000001-20251022011048123200000003]
aws_iam_instance_profile.scim_server: Refreshing state... [id=scim-demo-20251022011047978200000002]
aws_route53_record.scim_server: Refreshing state... [id=Z0726191Q5GQ53YU4EOR_demo-entitlements-lowerdecks.com_A]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0c398cb65a93047f2]
aws_instance.scim_server: Refreshing state... [id=i-01d54e3497e513435]
aws_eip_association.scim_server: Refreshing state... [id=eipassoc-081e5e6fba71dda93]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip_association.scim_server must be replaced
-/+ resource "aws_eip_association" "scim_server" {
      ~ id                   = "eipassoc-081e5e6fba71dda93" -> (known after apply)
      ~ instance_id          = "i-01d54e3497e513435" # forces replacement -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-06bc0b7b554957a2e" -> (known after apply)
      ~ private_ip_address   = "172.31.22.191" -> (known after apply)
      ~ public_ip            = "107.23.97.74" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_instance.scim_server must be replaced
-/+ resource "aws_instance" "scim_server" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:357013128720:instance/i-01d54e3497e513435" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-01d54e3497e513435" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-06bc0b7b554957a2e" -> (known after apply)
      ~ private_dns                          = "ip-172-31-22-191.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.31.22.191" -> (known after apply)
      ~ public_dns                           = "ec2-107-23-97-74.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "107.23.97.74" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "scim-demo-20251022005315833600000002",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-05d8c7b812ec09222" -> (known after apply)
        tags                                 = {
            "Name" = "scim-demo-server"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = (sensitive value) # forces replacement
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:357013128720:key/13589b17-d088-4806-a982-82c7b15bc4dc" -> (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {
              - "Environment" = "demo"
              - "ManagedBy"   = "Terraform"
              - "Owner"       = "joevanhorn"
              - "Project"     = "API Entitlements Demo"
              - "Repository"  = "api-entitlements-demo"
            } -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0269a95a2c0e90d89" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ instance_id        = "i-01d54e3497e513435" -> (known after apply)
  ~ ssm_command        = "aws ssm start-session --target i-01d54e3497e513435" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @joevanhorn, Action: `pull_request`*
*Workflow: [`Terraform Plan on PR`](https://github.com/joevanhorn/api-entitlements-demo/actions/runs/18706527155)*